In [1]:
import pandas as pd

In [13]:
frame=pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [14]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [17]:
frame=pd.read_csv('dataset.tsv', header=0, sep='\t')

In [18]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [19]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [20]:
frame.shape

(6, 4)

In [27]:
new_line={'Name':'Petrov', 'Birth':'15.02.1972' , 'City':'St.Petersburg'}

In [29]:
frame.append(new_line, ignore_index=True)

              Name       Birth           City  Position
0      Иванов А.А.  22.03.1980         Москва       NaN
1     Сорокин И.В.  07.08.1965      Волгоград   инженер
2       Белов М.М.  13.02.1980         Ростов  менеджер
3  Мельникова Д.С.  15.04.1985         Ростов       NaN
4      Рыбина Е.П.  19.11.1985         Москва   инженер
5     Костров С.О.  31.05.1985         Москва    стажер
6           Petrov  15.02.1972  St.Petersburg       NaN

In [30]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [31]:
frame=frame.append(new_line, ignore_index=True)

In [32]:
frame

              Name       Birth           City  Position
0      Иванов А.А.  22.03.1980         Москва       NaN
1     Сорокин И.В.  07.08.1965      Волгоград   инженер
2       Белов М.М.  13.02.1980         Ростов  менеджер
3  Мельникова Д.С.  15.04.1985         Ростов       NaN
4      Рыбина Е.П.  19.11.1985         Москва   инженер
5     Костров С.О.  31.05.1985         Москва    стажер
6           Petrov  15.02.1972  St.Petersburg       NaN

In [37]:
frame['IsStudent']=[False]*5+[True]*2

In [38]:
frame

              Name       Birth           City  Position IsStudent
0      Иванов А.А.  22.03.1980         Москва       NaN     False
1     Сорокин И.В.  07.08.1965      Волгоград   инженер     False
2       Белов М.М.  13.02.1980         Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985         Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985         Москва   инженер     False
5     Костров С.О.  31.05.1985         Москва    стажер      True
6           Petrov  15.02.1972  St.Petersburg       NaN      True

In [40]:
frame.drop([5,6], axis=0)

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False

In [41]:
frame.drop('IsStudent', axis=1, inplace=True)

In [42]:
frame

              Name       Birth           City  Position
0      Иванов А.А.  22.03.1980         Москва       NaN
1     Сорокин И.В.  07.08.1965      Волгоград   инженер
2       Белов М.М.  13.02.1980         Ростов  менеджер
3  Мельникова Д.С.  15.04.1985         Ростов       NaN
4      Рыбина Е.П.  19.11.1985         Москва   инженер
5     Костров С.О.  31.05.1985         Москва    стажер
6           Petrov  15.02.1972  St.Petersburg       NaN

In [43]:
frame.to_csv('upd.csv', sep=',', header=True, index=False)

In [45]:
!more upd.csv

Name,Birth,City,Position
Ð˜Ð²Ð°Ð½Ð¾Ð² Ð�.Ð�.,22.03.1980,ÐœÐ¾Ñ�ÐºÐ²Ð°,
Ð¡Ð¾Ñ€Ð¾ÐºÐ¸Ð½ Ð˜.Ð’.,07.08.1965,Ð’Ð¾Ð»Ð³Ð¾Ð³Ñ€Ð°Ð´,Ð¸Ð½Ð¶ÐµÐ½ÐµÑ€
Ð‘ÐµÐ»Ð¾Ð² Ðœ.Ðœ.,13.02.1980,Ð Ð¾Ñ�Ñ‚Ð¾Ð²,Ð¼ÐµÐ½ÐµÐ´Ð¶ÐµÑ€
ÐœÐµÐ»ÑŒÐ½Ð¸ÐºÐ¾Ð²Ð° Ð”.Ð¡.,15.04.1985,Ð Ð¾Ñ�Ñ‚Ð¾Ð²,
Ð Ñ‹Ð±Ð¸Ð½Ð° Ð•.ÐŸ.,19.11.1985,ÐœÐ¾Ñ�ÐºÐ²Ð°,Ð¸Ð½Ð¶ÐµÐ½ÐµÑ€
ÐšÐ¾Ñ�Ñ‚Ñ€Ð¾Ð² Ð¡.Ðž.,31.05.1985,ÐœÐ¾Ñ�ÐºÐ²Ð°,Ñ�Ñ‚Ð°Ð¶ÐµÑ€
Petrov,15.02.1972,St.Petersburg,